#  Task 1-Create a dataset with 10 rows and 4 columns, where one of the columns must be a salary column.

In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.read_csv('employee_details.csv')

In [3]:
df

  employeeId            name          position    salary
0         e1        John Doe           Manager  $80,000
1         e2      Jane Smith           Analyst  $60,000
2         e3    Mike Johnson         Sales Rep  $50,000
3         e4     Emily Davis     HR Specialist  $65,000
4         e5     James Brown         Developer  $75,000
5         e6  Patricia Jones    Marketing Exec  $70,000
6         e7   Robert Miller        Accountant  $70,000
7         e8     Mary Taylor  Office Assistant  $40,000
8         e9   Richard White   devops engineer  $95,000
9        e10    Susan Harris         Sales Rep  $50,000

# Task 2- Calculate the total revenue generated

In [4]:
# creating dataframe of the dataset 
df = pd.DataFrame({
    "employeeId": ["e1","e2","e3","e4","e5","e6","e7","e8","e9","e10"],
    "name": ["John Doe", "Jane Smith", "Mike Johnson", "Emily Davis", "James Brown", "Patricia Jones", "Robert Miller", "Mary Taylor", "Richard White", "Susan Harris"],
    "position":["Manager", "Analyst", "Sales Rep", "HR Specialist", "Developer", "Marketing Exec", "Accountant", "Office Assistant", "devops engineer", "Sales Rep"],
    "salary": [80000, 60000, 50000, 65000, 75000, 70000, 70000, 40000, 95000, 50000]
})

In [5]:
# To print the "Salary" column / calculating the total revenue generated of the employees salaries
print(np.sum(df['salary']))

655000

# Task 3- Find the average salary for every employee

In [6]:
pt=np.sum(df['salary'])

In [7]:
average_salary=pt//10 # '//' will remove the digits after demcial point and it will print only the interger

In [8]:
print(average_salary)

65500

# Task 4 -Check the data types of each column in the DataFrame.

In [9]:
print(df.dtypes)

employeeId    object
name          object
position      object
salary         int64
dtype: object

int64 indicates that the "Salary" columns contain integer data.

object typically indicates that the "Employee ID" ,"Name" and "Position" columns contain string (text) data in pandas.